app/views/orders/cart.html.slim

SELECT "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = $1  [["order_id", 1]]
---
    tbody
    - @cart.order_items.each do |oi|