app/views/items/index.html.slim

    .col-lg-12.col-md-12.col-sm-12.items
      - @items.each do | item |
        .col-lg-3.col-md-4.col-sm-6.col-xs-6.item
---
SELECT "items".* FROM "items"   ORDER BY id DESC