app/views/items/show.html.slim

SELECT "items"."id" FROM "items"
---
      h4.uppercase = t('item.similar_models')
      - resource.items_viewed_with.each do |item|
        .col-md-5ths.col-sm-3.col-xs-6
          .more-item-image