app/controllers/items_controller.rb

SELECT "items".* FROM "items"   ORDER BY id DESC
---
  def index
    @items = Item.order('id DESC').sort_by { |i| [@session.bought?(i) ? 0 : 1, @session.carted?(i) ? 1 : 0, -i.views] }