app/controllers/orders_controller.rb

SELECT  "items".* FROM "items"  WHERE "items"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = $1 AND "order_items"."item_id" = 2  ORDER BY "order_items"."id" ASC LIMIT 1  [["order_id", 1]]
UPDATE "items" SET "carted_with_this" = $1, "updated_at" = $2 WHERE "items"."id" = 2  [["carted_with_this", "\"1\"=>\"1\""], ["updated_at", "2014-10-28 22:56:58.286130"]]
UPDATE "order_items" SET "count" = $1, "each_price" = $2, "updated_at" = $3 WHERE "order_items"."id" = 13  [["count", 2], ["each_price", 37], ["updated_at", "2014-11-02 18:40:35.738627"]]
INSERT INTO "order_items" ("created_at", "item_id", "order_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-28 22:56:56.337548"], ["item_id", 2], ["order_id", 1], ["updated_at", "2014-10-28 22:56:56.337548"]]
INSERT INTO "orders" ("created_at", "session_id", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-10-28 23:13:06.288369"], ["session_id", 1], ["updated_at", "2014-10-28 23:13:06.288369"]]
---
  def add_to_cart
    item_id = params[:item_id]
    item = Item.find(item_id)

    order_item = @cart.order_items.where(item_id: item_id).first
    if order_item
      order_item.update_attributes(count: order_item.count + 1)
    else
      @cart.add(item)
      @cart.items << item

SELECT  "items".* FROM "items"  WHERE "items"."id" = $1 LIMIT 1  [["id", 17]]
SELECT  "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = $1 AND "order_items"."id" = $2 LIMIT 1  [["order_id", 3], ["id", 8]]
UPDATE "order_items" SET "count" = $1, "each_price" = $2, "updated_at" = $3 WHERE "order_items"."id" = 8  [["count", 2], ["each_price", 16], ["updated_at", "2014-11-02 18:38:24.539920"]]
---
  def inc
    oi = @cart.order_items.find(params[:order_item_id])
    oi.update_attributes(count: oi.count + 1) if oi

SELECT  "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = $1 AND "order_items"."id" = $2 LIMIT 1  [["order_id", 1], ["id", 3]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 3]]
---
  def dec
    oi = @cart.order_items.find(params[:order_item_id])
    if oi
      if oi.count > 1
        oi.update_attributes(count: oi.count - 1)
      else
        oi.destroy

SELECT  "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = $1 AND "order_items"."id" = $2 LIMIT 1  [["order_id", 1], ["id", 2]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 2]]
---
  def del
    oi = @cart.order_items.find(params[:order_item_id])
    oi.destroy if oi